## Pandas fundamentals

### 1. Cities in Sweden - create dataset

Create this DataFrame from scratch: 

|    | Kommun    |   Population |
|---:|:----------|-------------:|
|  0 | Malmö     |       347949 |
|  1 | Stockholm |       975551 |
|  2 | Uppsala   |       233839 |
|  3 | Göteborg  |       583056 |

&nbsp; a) Use your DataFrame to print out all the cities. (*)

&nbsp; b) Select only the row which contains Göteborg. Do this by using the name Göteborg. (*)

&nbsp; c) Sort the cities by population from largest to smallest. (*)

&nbsp; d) Filter out the three largest cities. (*)

&nbsp; e) The whole population in Sweden 2020 is 10379295. Use this number to create a new column in your sorted DataFrame named: Population (%). This column should be filled with percentage of the Swedish population for each city.

In [ ]:
import pandas as pd
import numpy as np

df_cities = pd.DataFrame({
    "Kommun": np.array(("Malmo", "Stockholm", "Uppsala", "Göteborg")),
    "Population": np.array((347949, 975551, 233839, 583056))
})

df_cities

      Kommun  Population
0      Malmo      347949
1  Stockholm      975551
2    Uppsala      233839
3   Göteborg      583056

In [16]:
df_cities["Kommun"]

0        Malmo
1    Stockholm
2      Uppsala
3     Göteborg
Name: Kommun, dtype: object

In [12]:
df_cities.loc[df_cities["Kommun"] == "Göteborg"]

     Kommun  Population
3  Göteborg      583056

In [15]:
cities_sorted = df_cities.sort_values(by="Population", ascending=False)
cities_sorted

      Kommun  Population
1  Stockholm      975551
3   Göteborg      583056
0      Malmo      347949
2    Uppsala      233839

In [14]:
cities_without_top3 = cities_sorted.iloc[3:]
cities_without_top3

    Kommun  Population
2  Uppsala      233839

In [ ]:
sweden_population = 10379295

cities_sorted["Population (%)"] = cities_sorted.apply(lambda row: (row.Population/sweden_population) * 100, axis=1)

cities_sorted

# or better

cities_sorted["Population (%)"] = (cities_sorted["Population"] / sweden_population) * 100